-- (𝜆𝑥.𝑥)(𝜆𝑦.𝑦)
-- Reduce this like this
-- [𝑥:=(𝜆𝑦.𝑦)]
-- 𝜆𝑦.𝑦

-- (𝜆𝑥.𝑥)(𝜆𝑦.𝑦)𝑧
-- ((𝜆𝑥.𝑥)(𝜆𝑦.𝑦))𝑧
-- [𝑥:=(𝜆𝑦.𝑦)]𝑧
-- (𝜆𝑦.𝑦)𝑧
-- [𝑦:=𝑧]
-- 𝑧

-- Multiple arguments
-- 𝜆𝑥𝑦.𝑥𝑦
-- 𝜆𝑥.(𝜆𝑦.𝑥𝑦)
-- Same lambda

-- 𝜆𝑥𝑦.𝑥𝑦
-- (𝜆𝑥𝑦.𝑥𝑦) 1 2
-- 𝜆𝑥.(𝜆𝑦.𝑥𝑦) 1 2
-- [𝑥:=1]
-- (𝜆𝑦.1𝑦) 2
-- [𝑦:=2]
-- 1 2

-- 𝜆𝑥𝑦.𝑥𝑦
-- (𝜆𝑥𝑦.𝑥𝑦)(𝜆𝑧.𝑎) 1
-- [𝑥:=(𝜆𝑧.𝑎)]
-- (𝜆𝑦.(𝜆𝑧.𝑎)𝑦) 1
-- [𝑦:=1]
-- (𝜆𝑧.𝑎) 1
-- [𝑧:=1]
-- 𝑎

-- (𝜆𝑎𝑏𝑐.𝑐𝑏𝑎)𝑧𝑧(𝜆𝑤𝑣.𝑤)
-- [𝑎:=𝑧]
-- (𝜆𝑏𝑐.𝑐𝑏𝑧)𝑧(𝜆𝑤𝑣.𝑤)
-- [𝑏:=𝑧]
-- (𝜆𝑐.𝑐𝑧𝑧)(𝜆𝑤𝑣.𝑤)
-- [𝑐:=(𝜆𝑤𝑣.𝑤)]
-- (𝜆𝑤𝑣.𝑤)𝑧𝑧
-- 𝑧